[
  {"id":1,"identityQuestions":"What's your name"},
  {"id":2,"identityQuestions":"What's your date of birth?"},
  {"id":3,"identityQuestions":"What's your address?"},
  {"id":4,"identityQuestions":"When did you get the green card?"},
  {"id":5,"identityQuestions":"How tall are you?"},
  {"id":6,"identityQuestions":"Where did you use to live"},
  {"id":7,"identityQuestions":"How many times have you married?"},
  {"id":8,"identityQuestions":"What's your son's name?"},
  {"id":9,"identityQuestions":"When was Charles born?"},
  {"id":10,"identityQuestions":"Do you have a job?"},
  {"id":11,"identityQuestions":"Have you ever claimed to be a U.S citizen?"},
  {"id":12,"identityQuestions":"Have you ever registered to vote or voted in any Federal, state or local election in the United States? If you lawfully voted only in a local election where aliens are eligible to vote, you may answer no"},
  {"id":13,"identityQuestions":"Do you currently owe any overdue Federal, state or local taxes in the United States?"},
  {"id":14,"identityQuestions":"Since you became a lawful permanent resident, have you called yourself a nonresident alien on a Federal, state or local tax return or decided not to file a tax return because you considered yourself to be a nonresident?"},
  {"id":15,"identityQuestions":"Have you ever been a member of, involved in, or in any way associated with any Communist or totalitarian party anywhere in the world?"},
  {"id":16,"identityQuestions":"Have you ever advocated (supported and promoted) any of the following, or been a member of, involved in, or in any way associated with any group anywhere in the world that advocated any of the following? Opposition to all organized government, World communism, The establishment in the United States of a totalitarian dictatorship, The overthrow by force or violence or other unconstitutional means of the Government of the United States or all forms of law, The unlawful assaulting or killing of any officer or officers of the Government of the United States or of any other organized government because of their official character, The unlawful damage, injury, or destruction of property, or, Sabotage"},
  {"id":17,"identityQuestions":"Have you ever ordered, incited, called for, committed, assisted, helped with, or otherwise participated in any of the following: Tortune, Genocide, Killing or trying to kill any person, Intentionally and severely injuring or trying to injure any person, Any kind of sexual contact or activity with any person who did not consent (did not agree) or was unable to consent (could not agree), or was being forced or threatened, by you or by someone else, Not letting someone practice his or her religion, Causing harm or suffering to any person because of his or her race, religion, national origin, membership in a particular social group, or political opinion"},
  {"id":18,"identityQuestions":"Have you ever served in, been a member of, assisted (helped), or participated in any military or police unit?"},
  {"id":19,"identityQuestions":"Have you ever served in, been a member of, assisted (helped), or participated in any armed group (a group that carries weapons), for example: paramilitary unit (a group of people who act like a military group but are not part of the official military), self-defense unit, vigilante unit, rebel group, or guerrilla group?"},
  {"id":20,"identityQuestions":"Have you ever worked, volunteered, or otherwise served in a place where people were detained (forced to stay), for example, a prison, jail, prison camp (a camp where prisoners of war or political prisoners are kept), detention facility, or labor camp, or have you EVER directed or participated in any other activity that involved detaining people?"},
  {"id":21,"identityQuestions":"Were you EVER a part of any group, or did you EVER help any group, unit, or organization that used a weapon against any person, or threatened to do so?"},
  {"id":22,"identityQuestions":"Have you EVER sold, provided, or transported weapons, or assisted any person in selling, providing, or transporting weapons, which you knew or believed would be used against another person?"},
  {"id":23,"identityQuestions":"Have you EVER received any weapons training, paramilitary training, or other military-type training?"},
  {"id":24,"identityQuestions":"Have you EVER recruited (asked), enlisted (signed up), conscripted (required to join), or used any person under 15 years of age to serve in or help a armed group, or attempted or worked with others to do so?"},
  {"id":25,"identityQuestions":"Have you EVER used any person under 15 years of age to take part in hostilities or attempted or worked with others to do so? This could include participating in combat or providing services related to combat (such as serving as a messenger or transporting supplies)."},
  {"id":26,"identityQuestions":"Have you EVER committed, agreed to commit, asked somone else to commit, helped commit, or tried to commit a crime or offense for which you were NOT arrested?"},
  {"id":27,"identityQuestions":"Have you EVER been arrested, cited, detained or confined by any law enforcement officer, military official (in the U.S or elsewhere), or immigration official for any reason, or been charged with a crime or offense?"},
  {"id":28,"identityQuestions":"Have you EVER: Engaged in prostitution, attempted to procure or import prostitutes or persons for the purpose of prostitution, or received any proceeds or money from prostitution? Manufactured, cultivated, produced, distributed, dispensed, solid, or smuggled (trafficked) any controlled substances, illegal drugs, narcotics, or drug paraphernalia in violation of any law or regulation of a U.S state, the United States, or a foreign country? Been married to more than one person at the same time? Married someone in order to obtain an immigration benefit? Helped anyone to enter, or try to enter, the united States illegally? Gambled illegally or received income from illegal gambling? Failed to support your dependents (pay child support) or to pay alimony (court-ordered financial support after divorce or separation)? Made any misrepresentation to obtain any public benefit in the United States?"},
  {"id":29,"identityQuestions":"Have you EVER given any U.S. Government officials any information or documentation that was false, fraudulent, or misleading?"},
  {"id":30,"identityQuestions":"Have you EVER lied to any U.S. Government officials to gain entry or admission into the United States or to gain immigration benefits while in the United States?"},
  {"id":31,"identityQuestions":"Are you a male who lived in the United States at any time between your 18th and 26th birthdays?"},
  {"id":32,"identityQuestions":"Have you EVER left the United States to avoid being drafted in the U.S. armed forces?"},
  {"id":33,"identityQuestions":"Have you EVER applied for any kind of exemption from military service in the U.S. armed forces"},
  {"id":34,"identityQuestions":"Have you EVER served in the U.S. armed forces?"},
  {"id":35,"identityQuestions":"Do you now have, or did you EVER have, a hereditary title or an order of nobility in any foreign country?"},
  {"id":36,"identityQuestions":"Do you support the Constitution and form of Government of the United States?"},
  {"id":37,"identityQuestions":"Do you understand the full Oath of Allegiance to the United States?"},
  {"id":38,"identityQuestions":"Are you unabled to take the Oath of Allegiance because of a physical or developmental disability or mental impairment?"},
  {"id":39,"identityQuestions":"Are you willing to take the full Oath of Allegiance to the United States?"},
  {"id":40,"identityQuestions":"If the law requires it, are you willing to bear arms (carry weapons) on behalf of the United States?"},
  {"id":41,"identityQuestions":"If the law requires it, are you willing to perform noncombatant services (do something that does not include fighting in a war) in the U.S. armed forces?)"},
  {"id":42,"identityQuestions":"If the law requires it, are you willing to perform work of national importance under civilian direction (do non-military work that the U.S. Government says is important to the country)?"}
]